In [1]:
'''
CREATE TABLE cust_info(Cust_ID int primary key, Cust_Name varchar(20), Cust_Address varchar(100), Cust_connect_date varchar(10), Contact_No varchar(15) );
'''

'\nCREATE TABLE cust_info(Cust_ID int primary key, Cust_Name varchar(20), Cust_Address varchar(100), Cust_connect_date varchar(10), Contact_No varchar(15) );\n'

In [2]:
'''
INSERT INTO cust_info (Cust_Id, Cust_Name, Cust_Address, Cust_connect_date, Contact_No) VALUES

(101, 'Rajeev Singh','Lucknow','12-12-2012','05226565114'),

(102, 'Jitendra Verma','Sitapur','01-01-2013','9838505980'),

(103,'Ravi Singh','barabanki','15-01-2013','9936652039'), 

(104,'priya Singh','Lucknow','16-01-2013','9936390301'), 

(105,'Brijesh Mishra','barabanki','16-02-2013','8738970899'),

(106,'Amit Singh','Lucknow','18-03-2013','05482202798');
'''

"\nINSERT INTO cust_info (Cust_Id, Cust_Name, Cust_Address, Cust_connect_date, Contact_No) VALUES\n\n(101, 'Rajeev Singh','Lucknow','12-12-2012','05226565114'),\n\n(102, 'Jitendra Verma','Sitapur','01-01-2013','9838505980'),\n\n(103,'Ravi Singh','barabanki','15-01-2013','9936652039'), \n\n(104,'priya Singh','Lucknow','16-01-2013','9936390301'), \n\n(105,'Brijesh Mishra','barabanki','16-02-2013','8738970899'),\n\n(106,'Amit Singh','Lucknow','18-03-2013','05482202798');\n"

In [4]:
'''
i) SELECT * FROM cust_info;

ii) SELECT Cust_Id, Cust_Name FROM cust_info;

iii) SELECT Cust_Id, Cust_Name, Cust_connect_date FROM cust_info WHERE Cust_connect_date>15-01-2013;

iv)  SELECT * FROM cust_info WHERE Cust_Address='Lucknow';

v) SELECT * FROM cust_info ORDER BY Cust_Name ASC;

vi) SELECT * FROM cust_info ORDER BY Cust_Name DESC;

'''

"\ni) SELECT * FROM cust_info;\n\nii) SELECT Cust_Id, Cust_Name FROM cust_info;\n\niii) SELECT Cust_Id, Cust_Name, Cust_connect_date FROM cust_info WHERE Cust_connect_date>15-01-2013;\n\niv)  SELECT * FROM cust_info WHERE Cust_Address='Lucknow';\n\nv) SELECT * FROM cust_info ORDER BY Cust_Name ASC;\n\nvi) SELECT * FROM cust_info ORDER BY Cust_Name DESC;\n\n"

In [3]:
'''
create table person
(
personid int primary key,
personname varchar(30),
contactno varchar(15),
emailaddress varchar(50)
);

i) alter table person add password varchar(10);

ii) alter table person drop password;

iii) alter table person rename column contactno to mobileno;

iv) alter table personal modify mobileno int;

'''

'\ncreate table person\n(\npersonid int primary key,\npersonname varchar(30),\ncontactno varchar(15),\nemailaddress varchar(50)\n);\n\ni) alter table person add password varchar(10);\n\nii) alter table person drop password;\n\niii) alter table person rename column contactno to mobileno;\n\niv) alter table personal modify mobileno int;\n\n'